public class Info {

    /**
     * 5. Классы и объекты
     * Понятие интерфейса, класса, абстрактного класса, объекта, конструктора класса
     * Методы
     * Object
     * equals
     * hashCode
     * @param args
     */
    public static void main(String[] args) {
        //расскзать про выравнивание при коммите.
        //lombok
        //класс, экземпляр класс (класс это шаблон)
        //конструкторы
        //this в конструкторе
        //пакеты, классы могут быть одинаковые в разных пакетах
        //import * и статический импорт, констната
        //логические блоки(значение по умолчанию) и статические(единожды что то сделать)
        // модификаторы доступа public private protected package
        //статическая переменная: персон сколько объектов было создано
        //внутренний класс
        //address
        //перегрузка метододов PersonRegistry
        //енам??
    }
}
