public class Info {
    public static void main(String[] args) {
        //класс, экземпляр класс
        //конструкторы
        //this в конструкторе
        //пакеты классы могут быть одинаковые в разных пакетах
        //import * и статический импорт, констната
        //логические блоки(значение по умолчанию) и статические(единожды что то сделать)
        // модификаторы доступа public private protected package
        //статическая переменная: персон сколько объектов было создано
        //внутренний класс
        //address

    }
}
