package com.home.model;

public class PublicPrivateProtectedDefault {
    //модификаторы доступа бывают Public Private Protected Default
    //для класса, метода или поля.

    //default(package) - Такие поля или методы видны всем классам в текущем пакете.
    //public - все везде доступно
    //protected - в пределах пакета, или у наследников и даже в любом пакете
    //private - только в классе, что бы не изменяли переменный то их закрываем и даем модификатор приватный
    //поговорим про гет и сет
    //Инкапсуляция - сокрытие данных внутри некоторой области видимости
}
